import { comma } from "common"
const 節 = {
	"春分": ["日天の中を行て昼夜等分の時也", "この日をはさんで前後7日間が春の彼岸になります。まだ花冷えや寒の戻りがある時期です。昼夜の長さがほぼ同じで、以降はは昼の時間が長くなって行きます。"],
	"清明": ["万物発して清浄明潔なれば此芽は何の草としれる也", "清浄明潔の略です。晴れ渡った空には清浄明潔という語ふさわしいですね。百花が咲き競う季節です。"],
	"穀雨": ["春雨降りて百穀を生化すれば也", "田んぼや畑の準備が整い、それに合わせるかのように、柔らかな春の雨が降る頃です。この頃より変りやすい春の天気も安定し日差しも強まります。"],
	"立夏": ["夏の立つがゆへ也", "この日から立秋の前日までが夏になります。野山に新緑に彩られ、夏の気配が感じられるようになります。かえるが鳴き始め、竹の子が生えてくる頃です。"],
	"小満": ["万物盈満すれば草木枝葉繁る", "陽気がよくなり、草木などの生物が次第に生長して生い茂るという意味です。西日本でははしり梅雨が現れる頃です。"],
	"芒種": ["芒ある穀類稼種する時也", "稲の穂先のように芒のある穀物の種まきをする頃という意味ですが、現在の種まきは大分早まっているようです。西日本では梅雨に入る頃になります。"],
	"夏至": ["陽熱至極しまた日の長きのいたりなるを以て也", "一年中で一番昼が長い時期ですが、日本の大部分は梅雨の時期なのであまり実感がありません。花しょうぶや紫陽花などの雨の似合う花が咲く季節です。"],
	"小暑": ["大暑来れる前なれば也", "梅雨明けが近く、本格的な暑さが始まる頃です。集中豪雨のシーズン。蓮の花が咲き、蝉の合唱が始まる頃です。"],
	"大暑": ["暑気いたりつまりたるゆえんなれば也", "最も暑い頃という意味ですが実際はもう少し後ですね。夏の土用の時期。学校は夏休みに入り、空には雲の峰が高々とそびえるようになります。"],
	"立秋": ["初めて秋の気立つがゆへなれば也", "この日から立冬の前日までが秋。一年で一番暑い頃ですが、一番暑いと言うことはあとは涼しくなるばかりです。暑中見舞いはこの前日までで以降は残暑見舞いです。"],
	"処暑": ["陽気とどまりて初めて退きやまんとすれば也", "処暑は暑さが止むと言う意味です。萩の花が咲き、朝夕は心地よい涼風が吹く頃ですが、台風のシーズンでもあります。"],
	"白露": ["陰気ようやく重なりて露こごりて白色となれば也", "稲穂が顔を出し、秋の趣がひとしお感じられる頃です。朝夕の心地よい涼風に、幾分の肌寒さを感じさせる冷風が混じり始めます。"],
	"秋分": ["陰陽の中分となれば也", "暑い日は減り代わりに涼しさを感ずる日が増えてきます。昼と夜の長さがほぼ同じになり、秋分は秋の彼岸の中日でもあります。秋の七草が咲き揃う頃です。"],
	"寒露": ["陰寒の気に合って露むすび凝らんとすれば也", "冷たい露の結ぶ頃。秋もいよいよ本番です。菊の花が咲き始め、山の木々の葉は紅葉の準備に入ります。稲刈りもそろそろ終わる時期です。"],
	"霜降": ["つゆが陰気に結ばれて霜となりて降るゆへ也", "北国や山間部では、霜が降りて朝には草木が白く化粧をする頃です。野の花の数は減り始めますが、かわって山を紅葉が飾る頃です。"],
	"立冬": ["冬の気立ち初めていよいよ冷ゆれば也", "この日から立春の前日までが冬。日は短くなり時雨が降る季節。北国や高山からは初雪の知らせも届き、関東では空っ風が吹く頃です。"],
	"小雪": ["冷ゆるが故に雨も雪となりてくだるがゆへ也", "陽射しは弱まり、冷え込みが厳しくなる季節。木々の葉は落ち、平地にも初雪が舞い始める頃です。"],
	"大雪": ["雪いよいよ降り重ねる折からなれば也", "朝夕には池や川に氷を見るようになります。大地の霜柱を踏むのもこの頃から。山々は雪の衣をまとって冬の姿となる頃です。"],
	"冬至": ["日南の限りを行て日の短きの至りなれば也", "一年中で最も夜の長い日。この日より日が伸び始めることから、古くはこの日を年の始まりと考えました。冬至南瓜や柚湯の慣習が残る日です。"],
	"小寒": ["冬至より一陽起るが故に陰気に逆らう故益々冷る也", "この日は寒の入り。これから節分までの期間が「寒」です。寒さはこれからが本番。池や川の氷も厚みをます頃です。"],
	"大寒": ["冷ゆることの至りて甚だしきときなれば也", "一年で一番寒さの厳しい頃 。逆の見方をすれば、これからは暖かくなるということです。春はもう目前です。"],
	"立春": ["春の気たつを以て也", "この日から立夏の前日までが春。まだ寒さの厳しい時期ですが日脚は徐々に伸び始め、九州や太平洋側の暖かい地方では梅が咲き始める頃です。"],
	"雨水": ["陽気地上に発し雪氷とけて雨水となれば也", "空から降るものが雪から雨に替わる頃。深く積もった雪も融け始めます。春一番が吹き、九州南部ではうぐいすの鳴き声が聞こえ始めます。"],
	"啓蟄": ["陽気地中にうごきちぢまる虫穴をひらき出れば也", "冬眠していた蛇や蛙などが暖かさに誘われて冬眠から覚めて初めて姿を見せる頃という意味です。柳の若芽が芽吹き蕗のとうの花が咲く頃です。"],
////
	"土用入": ["", "立春・立夏・立秋・立冬の前の18日間を土用といいます。土用の期間は、土公神が支配するといわれ、土を動かしてはいけないとされます。"],
	"入梅": ["", "梅雨入りの時期に設定された雑節です。現在の日本では、太陽黄経が80度の日です。"],
	"半夏生": ["", "雑節の一つで、半夏（烏柄杓）という薬草が生える頃です。現在の日本では、太陽黄経が100度の日です。"],
	"節分": ["", "雑節の一つで、「季節を分ける」という意味から\立春・立夏・立秋・立冬の前日ですが、江戸時代以降は特に立春の前日のことをいいます"],
	"八十八夜": ["", "雑節の一つで、立春を起算日として88日目です。この日にお茶を飲むと長生きすると言われます。"],
	"二百十日": ["", "雑節の一つで、立春を起算日として210日目です。台風に見舞われることが多い時期から農家の厄日とされます。"],
	"二百二十日": ["", "雑節の一つで、立春を起算日として220日目です。台風に見舞われることが多い時期から農家の厄日とされます。"],
	"彼岸入": ["", "春分と秋分の前後3日間を合わせた7日間の初日です。この時期は、太陽が真東から昇り真西に沈むので彼岸(あの世)と此岸(この世)が通じやすい日とされ、先祖の供養をします。"],
	"彼岸明": ["", "春分と秋分の前後3日間を合わせた7日間の終日です。「暑さ寒さも彼岸まで」というように、残寒・残暑は彼岸のころまで続き、彼岸をすぎるとやわらぐと言われます。"],
};
const 曜 = {
	"先勝": "「先んずれば即ち勝つ」万事に急ぐことが良いとされる。午前中は吉、午後二時より六時までは凶。",
	"友引": "「凶事に友を引く」朝は吉、昼は凶、夕は大吉とされる。友が冥土に引き寄せると言われ、葬式は凶。",
	"先負": "「先んずれば即ち負ける」午前中は凶、午後は吉とされる。万事に平静であることが良いとされ、勝負事や急用は避ける。",
	"仏滅": "六曜の中で最も凶の日とされ、婚礼などの祝儀を忌む習慣がある。何事も遠慮する日、病めば長引く、仏事は吉",
	"大安": "「大いに安し」の意味。六曜の中で最も吉の日とされる。何事においても吉。婚礼はこの日に行われることが多い。",
	"赤口": "午の刻(お昼)と法事のみ吉で、それ以外は凶とされる。火の元、刃物に気をつける。"
};
const 直 = {
	"建": ["たつ", "万物を建て生じる日\nよろず大吉の日。但し動土・蔵開きは凶"],
	"除": ["のぞく", "障害を取り除く日\n井戸掘り・治療開始・祭祀などは吉。結婚・動土は凶"],
	"満": ["みつ", "全てが満たされる日\n新規事・移転・結婚などは吉。動土・服薬は凶"],
	"平": ["たいら", "物事が平らかになる日\n旅行・結婚・道路修理などは吉。穴掘り・種まきは凶"],
	"定": ["さだん", "善悪が定まる日\n開店・結婚・移転・種まきは吉。旅行・訴訟は凶"],
	"執": ["とる", "執り行う日\n祭祀・祝い事・造作・種まきは吉。金銭の出入りは凶"],
	"破": ["やぶる", "物事を突破する日\n訴訟・出陣・漁猟・服薬は吉。祝い事・契約事は凶"],
	"危": ["あやぶ", "物事を危惧する日\n万事控えめに"],
	"成": ["なる", "物事が成就する日\n新規事・建築・開店は吉。訴訟・談判は凶"],
	"納": ["おさん", "物事を納め入れる日\n収穫・商品購入は吉。結婚・見合いは凶"],
	"開": ["ひらく", "開き通じる日\n建築・移転・結婚等は吉。葬式は凶"],
	"閉": ["とづ", "閉じ込める日\n金銭出納・建墓は吉。棟上げ・結婚・開店は凶"]
};
const 宿 = {
	"角": ["かく", "おとめ座α(す星)\n着始め・柱立て・普請造作・結婚に吉。葬式に凶"],
	"亢": ["こう", "おとめ座κ(あみ星)\n衣類仕立て・物品購入・種まきに吉。造作に凶"],
	"氐": ["てい", "てんびん座α(とも星)\n結婚・開店・結納・酒造りに吉。着始めに凶"],
	"房": ["ぼう", "さそり座π(そい星)\n髪切り・結婚・旅行・移転・開店・祭祀に吉"],
	"心": ["しん", "さそり座σ(なかご星)\n祭祀・移転・旅行・新規事に吉。造作・結婚に凶。盗難注意"],
	"尾": ["び", "さそり座μ(あしたれ星)\n結婚・開店・移転・造作・新規事に吉。着始め・仕立てに凶"],
	"箕": ["き", "いて座γ(み星)\n動土・池掘り・仕入れ・集金・改築に吉。結婚・葬式に凶"],
	"斗": ["と", "いて座φ(ひきつ星)\n土掘り・開店・造作に吉"],
	"牛": ["ぎゅう", "やぎ座β(いなみ星)\n移転・旅行・金談など全てに吉"],
	"女": ["じょ", "みずがめ座ε(うるき星)\n稽古始め・お披露目に吉。訴訟・結婚・葬式に凶"],
	"虚": ["きょ", "みずがめ座β(とみて星)\n着始め・学問始めに吉。相談・造作・積極的な行動に凶"],
	"危": ["き", "みずがめ座α(うみやめ星)\n壁塗り・船普請・酒作りに吉。衣類仕立て・高所作業に凶"],
	"室": ["しつ", "ペガスス座α(はつい星)\n祈願始め・結婚・祝い事・祭祀・井戸掘りに吉"],
	"壁": ["へき", "ペガスス座γ(なまめ星)\n開店・旅行・結婚・衣類仕立て・新規事開始に吉"],
	"奎": ["けい", "アンドロメダ座ζ(とかき星)\n開店・文芸開始・樹木植替えに吉"],
	"婁": ["ろう", "おひつじ座β(たたら星)\n動土・造作・縁談・契約・造園・衣類仕立てに吉"],
	"胃": ["い", "おひつじ座35番(えきえ星)\n開店・移転・求職に吉"],
	"昴": ["ぼう", "おうし座17番(すばる星)\n神仏詣で・祝い事・開店に吉"],
	"畢": ["ひつ", "おうし座ε(あめふり星)\n祭祀・取引開始・普請開始・土地開拓・縁談に吉"],
	"觜": ["し", "オリオン座λ(とろき星)\n稽古始め・運搬始めに吉。造作・衣類着始めに凶"],
	"参": ["しん", "オリオン座ζ(からすき星)\n仕入れ・納入・取引開始・祝い事・縁談に吉"],
	"井": ["せい", "ふたご座μ(ちちり星)\n神仏詣で・種まき・動土・普請に吉。衣類仕立てに凶"],
	"鬼": ["き", "かに座θ(たまおの星)\n婚礼のみ凶。他の事には全て吉"],
	"柳": ["りゅう", "うみへび座δ(ぬりこ星)\n物事を断るのに吉。結婚・開店・葬式に凶"],
	"星": ["せい", "うみへび座α(ほとおり星)\n乗馬始め・便所改造に吉。祝い事・種まきに凶"],
	"張": ["ちょう", "うみへび座υ1(ちりこ星)\n就職・見合い・神仏祈願・祝い事に吉"],
	"翼": ["よく", "コップ座α(たすき星)\n耕作始め・植え替え・種まきに吉。高所作業・結婚に凶"],
	"軫": ["しん", "からす座γ(みつかけ星)\n地鎮祭・落成式・祭祀・祝い事に吉。衣類仕立てに凶"]
};
const 注 = {
	"受死日": "黒日ともいう。市販の暦では「●日」とも書かれる。最悪の大凶日とされ、この日は他の暦注は一切見る必要がない。この日に病を患えば必ず死ぬとまで言われる。病気見舞い、服薬、針灸、旅行が特に凶。ただ葬式だけは差し支えない。",
	"十死日": "暦には「十し」と書かれる。受死日(黒日)の次に凶日とされ、全てのことに凶とされる。ただし、受死日と違い葬式も差し支えありとしている。",
	"五墓日": "凶日で、家作りは構わないが、動土・地固め・葬式・墓作り・種まき(播種)・旅行・祈祷などは凶。",
	"帰忌日": "天棓星の精・帰忌が地上に降りて来て、人家の門の前で家人が帰って来るのを妨害するとされる日。遠出・帰家・移徙(わたまし:貴人の転居)・呼女・娶婦は避ける。金の貸し借りも凶。",
	"血忌日": "血を見ることが凶。特に鍼灸・刑戮(死刑執行)・狩猟などは凶",
	"天火日": "棟上げ・屋根葺きなどをすると、火災があるとされている。家屋の修理や移徙(わたまし:貴人の転居)は凶。",
	"地火日": "動土・定礎・柱建て・井戸掘り・種まき・築墓・葬式などは凶。",
	"凶会日": "陰陽二気の調和がうまく行かず、万事に忌むべき。この日に吉事を行うことは凶とされる。",
	"往亡日": "軍を進めることや遠行が忌まれた。拝官・移転・婚礼などが凶。",
	"大禍日": "三箇の悪日の一つ。中でも最も悪い日とされ、口舌は慎み、家の修理・門戸の建造・船旅・葬送は大凶。",
	"狼藉日": "三箇の悪日の一つ。万事に凶。この日を犯すと、百事皆失敗する。",
	"滅門日": "三箇の悪日の一つ。万事に凶。この日を犯すと、一家一門を亡ぼすと言われる。",
	"時下食": "その時間には食事の他、種まきや俵を開けること、沐浴・草木を植えることは凶",
	"歳下食": "軽い凶日。他の暦注に吉日があれば忌む必要はない。他の凶日と重なると、より重くなる。この日は、大食・大酒を慎む日とされる。種まきや俵を開けること、草木を植えることは凶。",
	"天赦日": "七箇の善日の一つ。天が万物の罪を赦す日とされ、最上の大吉日。暦には「万よし」とも注記される。",
	"神吉日": "七箇の善日の一つ。神事に関すること、すなわち神社に詣でること、祭礼・祖先を祀ることは吉。",
	"大明日": "七箇の善日の一つ。天地が開通して、隅々まで太陽の日が照る日。全ての吉事・善事に大吉。特に建築・移転・旅行に良い。",
	"鬼宿日": "七箇の善日の一つ。婚礼のみ凶。他の事には全て吉。",
	"天恩日": "七箇の善日の一つ。天の恩恵を受ける日で、吉事に用いて大吉であるが、凶事に用いてはならない。",
	"母倉日": "七箇の善日の一つ。母が子を育てるように天が人間を慈しむ日。何事にも吉で、特に婚姻は大吉とされる。普請・造作も吉。",
	"月徳日": "七箇の善日の一つ。家の増改築など土に関わる行は吉。",
	"重日": "この日に行ったことは重なって起るとされる。吉事には吉で、凶事には凶とされる。婚礼は再婚に繋がるので良くないとされる。",
	"復日": "この日に吉事を行えば吉が重なり、凶事を行えば凶が重なるとされる。婚礼は再婚に繋がるので凶である。",
	"社日": "「社」とは土地の守護神・土の神を意味する。雑節の一つで、産土神(生まれた土地の守護神)を祀る日。春と秋にあり、春分または秋分に最も近い戊の日が社日となる。",
	"八専": "日の干支が壬子(49番目)から癸亥(60番目)の間の12日間の中に干支ともに同じ五行となるものが壬子/甲寅/乙卯/丁巳/己未/庚申/辛酉/癸亥と8日あるため八専と総称されている。吉はますます吉となり、凶はますます凶となるとされる。",
	"八専間日": "八専の12日間のうち干支の五行が異なる4日を八専の間日(まび)という。",
	"十方暮": "天地の気が相剋して、万事うまく行かない凶日とされている。労多くして功の少ない日。",
	"不成就日": "何事も成就しない日とされ、結婚・開店・子供の命名・移転・契約・芸事始め・願い事など、事を起こすことが凶。",
	"天一天上": "天一神が天上に帰りその祟りはなくなる期間。その代わりに日遊神が地上に降り家の中に留まるので、この期間は家の中を清潔にしなければ日遊神の祟りがあるとされている。",
	"三隣亡": "建築関係の凶日とされ、棟上げや土起こしなど建築に関することは一切忌むべき日とされた。高い所へ登るとけがをする。",
	"初伏": "三伏の最初で、夏至以後の3回目庚の日とすることが多い。種まき・療養・遠行・男女の和合などを、全て慎むべき日とされている。",
	"中伏": "三伏の2回目で、夏至以後の4回目庚の日とすることが多い。種まき・療養・遠行・男女の和合などを、全て慎むべき日とされている。",
	"末伏": "三伏の最後で、立秋以後の1回目庚の日とすることが多い。種まき・療養・遠行・男女の和合などを、全て慎むべき日とされている。",
	"一粒万倍日": "一粒の籾が万倍にも実る稲穂になるという意味である。何事を始めるにも良い日とされ、仕事始め、開店、種まき、お金を出すことに吉。但し、借金は苦労の種を蒔くので凶。",
	"大犯土": "土を犯してはならない。穴掘り・井戸掘り・種まき・土木工事・伐採など土いじりは一切慎むべき。特に、地鎮祭等の建築儀礼は凶。",
	"小犯土": "土を犯してはならない。穴掘り・井戸掘り・種まき・土木工事・伐採など土いじりは一切慎むべき。特に、地鎮祭等の建築儀礼は凶。",
	"臘日": "冬の水気を土剋水で止めて、春に向けて気を動かす日であるとされる。吉今日に関しては定かでない。",
	"土用": "五行に由来する暦の雑節で、四立（立夏・立秋・立冬・立春）の直前約18日間である。五行では、春に木、夏に火、秋に金、冬に水を割り当てている。残った土は季節の変わり目に割り当てられ、これを「土旺用事」=>「土用」と呼んだ。",
	"土用の丑": "夏の疲れが出る頃で、うなぎを食べてスタミナをつける日。",
	"甲子": "甲が木性、子が水性で相生（水生木）の関係にあり、また、干支の組合せの1番目であることから、甲子の日は吉日とされている。",
	"己巳": "己巳の日は、弁才天の縁日である",
	"庚辰": "十干の庚は陽の金、十二支の辰は陽の土で、相生（土生金）である。",
	"辛酉": "",
};
const 休日 = {
	2001: [[0, 1], [7, 2], [41, 3], [42, 0], [78, 4], [118, 7], [119, 0], [122, 6], [123, -1], [124, 8], [200, 9], [257, 11], [265, 12], [266, 0], [280, 13], [306, 14], [326, 15], [356, 16], [357, 0]],
	2002: [[0, 1], [13, 2], [41, 3], [79, 4], [118, 7], [122, 6], [123, -1], [124, 8], [125, 0], [200, 9], [257, 11], [258, 0], [265, 12], [286, 13], [306, 14], [307, 0], [326, 15], [356, 16]],
	2003: [[0, 1], [12, 2], [41, 3], [79, 4], [118, 7], [122, 6], [123, -1], [124, 8], [201, 9], [257, 11], [265, 12], [285, 13], [306, 14], [326, 15], [327, 0], [356, 16]],
	2004: [[0, 1], [11, 2], [41, 3], [79, 4], [119, 7], [123, 6], [124, -1], [125, 8], [200, 9], [263, 11], [266, 12], [284, 13], [307, 14], [327, 15], [357, 16]],
	2005: [[0, 1], [9, 2], [41, 3], [78, 4], [79, 0], [118, 7], [122, 6], [123, -1], [124, 8], [198, 9], [261, 11], [265, 12], [282, 13], [306, 14], [326, 15], [356, 16]],
	2006: [[0, 1], [1, 0], [8, 2], [41, 3], [79, 4], [118, 7], [122, 6], [123, -1], [124, 8], [197, 9], [260, 11], [265, 12], [281, 13], [306, 14], [326, 15], [356, 16]],
	2007: [[0, 1], [7, 2], [41, 3], [42, 0], [79, 4], [118, 5], [119, 0], [122, 6], [123, 7], [124, 8], [196, 9], [259, 11], [265, 12], [266, 0], [280, 13], [306, 14], [326, 15], [356, 16], [357, 0]],
	2008: [[0, 1], [13, 2], [41, 3], [79, 4], [119, 5], [123, 6], [124, 7], [125, 8], [126, 0], [202, 9], [258, 11], [266, 12], [286, 13], [307, 14], [327, 15], [328, 0], [357, 16]],
	2009: [[0, 1], [11, 2], [41, 3], [78, 4], [118, 5], [122, 6], [123, 7], [124, 8], [125, 0], [200, 9], [263, 11], [264, -1], [265, 12], [284, 13], [306, 14], [326, 15], [356, 16]],
	2010: [[0, 1], [10, 2], [41, 3], [79, 4], [80, 0], [118, 5], [122, 6], [123, 7], [124, 8], [199, 9], [262, 11], [265, 12], [283, 13], [306, 14], [326, 15], [356, 16]],
	2011: [[0, 1], [9, 2], [41, 3], [79, 4], [118, 5], [122, 6], [123, 7], [124, 8], [198, 9], [261, 11], [265, 12], [282, 13], [306, 14], [326, 15], [356, 16]],
	2012: [[0, 1], [1, 0], [8, 2], [41, 3], [79, 4], [119, 5], [120, 0], [123, 6], [124, 7], [125, 8], [197, 9], [260, 11], [265, 12], [281, 13], [307, 14], [327, 15], [357, 16], [358, 0]],
	2013: [[0, 1], [13, 2], [41, 3], [78, 4], [118, 5], [122, 6], [123, 7], [124, 8], [125, 0], [195, 9], [258, 11], [265, 12], [286, 13], [306, 14], [307, 0], [326, 15], [356, 16]],
	2014: [[0, 1], [12, 2], [41, 3], [79, 4], [118, 5], [122, 6], [123, 7], [124, 8], [125, 0], [201, 9], [257, 11], [265, 12], [285, 13], [306, 14], [326, 15], [327, 0], [356, 16]],
	2015: [[0, 1], [11, 2], [41, 3], [79, 4], [118, 5], [122, 6], [123, 7], [124, 8], [125, 0], [200, 9], [263, 11], [264, -1], [265, 12], [284, 13], [306, 14], [326, 15], [356, 16]],
	2016: [[0, 1], [10, 2], [41, 3], [79, 4], [80, 0], [119, 5], [123, 6], [124, 7], [125, 8], [199, 9], [223, 10], [262, 11], [265, 12], [283, 13], [307, 14], [327, 15], [357, 16]],
	2017: [[0, 1], [1, 0], [8, 2], [41, 3], [78, 4], [118, 5], [122, 6], [123, 7], [124, 8], [197, 9], [222, 10], [260, 11], [265, 12], [281, 13], [306, 14], [326, 15], [356, 16]],
	2018: [[0, 1], [7, 2], [41, 3], [42, 0], [79, 4], [118, 5], [119, 0], [122, 6], [123, 7], [124, 8], [196, 9], [222, 10], [259, 11], [265, 12], [266, 0], [280, 13], [306, 14], [326, 15], [356, 16], [357, 0]],
	2019: [[0, 1], [13, 2], [41, 3], [79, 4], [118, 5], [119, -1], [120, -2], [121, -1], [122, 6], [123, 7], [124, 8], [125, 0], [195, 9], [222, 10], [223, 0], [258, 11], [265, 12], [286, 13], [294, -3], [306, 14], [307, 0], [326, 15]],
	2020: [[0, 1], [12, 2], [41, 3], [53, 16], [54, 0], [79, 4], [119, 5], [123, 6], [124, 7], [125, 8], [126, 0], [204, 9], [205, 17], [222, 10], [264, 11], [265, 12], [307, 14], [327, 15]],
	2021: [[0, 1], [10, 2], [41, 3], [53, 16], [78, 4], [118, 5], [122, 6], [123, 7], [124, 8], [202, 9], [219, 10], [220, 0], [262, 11], [265, 12], [203, 17], [306, 14], [326, 15]],
	2022: [[0, 1], [9, 2], [41, 3], [53, 16], [79, 4], [118, 5], [122, 6], [123, 7], [124, 8], [198, 9], [222, 10], [261, 11], [265, 12], [282, 17], [306, 14], [326, 15]],
	2023: [[0, 1], [1, 0], [8, 2], [41, 3], [53, 16], [79, 4], [118, 5], [122, 6], [123, 7], [124, 8], [197, 9], [222, 10], [260, 11], [265, 12], [281, 17], [306, 14], [326, 15]],
	2024: [[0, 1], [7, 2], [41, 3], [42, 0], [53, 16], [79, 4], [119, 5], [123, 6], [124, 7], [125, 8], [126, 0], [196, 9], [223, 10], [224, 0], [259, 11], [265, 12], [266, 0], [287, 17], [307, 14], [308, 0], [327, 15]],
	2025: [[0, 1], [12, 2], [41, 3], [53, 16], [54, 0], [78, 4], [118, 5], [122, 6], [123, 7], [124, 8], [125, 0], [201, 9], [222, 10], [257, 11], [265, 12], [285, 17], [306, 14], [326, 15], [327, 0]],
	2026: [[0, 1], [11, 2], [41, 3], [53, 16], [78, 4], [118, 5], [122, 6], [123, 7], [124, 8], [125, 0], [200, 9], [222, 10], [263, 11], [264, -1], [265, 12], [284, 17], [306, 14], [326, 15]],
	2027: [[0, 1], [10, 2], [41, 3], [53, 16], [79, 4], [80, 0], [118, 5], [122, 6], [123, 7], [124, 8], [199, 9], [222, 10], [262, 11], [265, 12], [283, 17], [306, 14], [326, 15]],
	2028: [[0, 1], [9, 2], [41, 3], [53, 16], [79, 4], [119, 5], [123, 6], [124, 7], [125, 8], [198, 9], [223, 10], [261, 11], [265, 12], [282, 17], [307, 14], [327, 15]],
	2029: [[0, 1], [7, 2], [41, 3], [53, 16], [42, 0], [78, 4], [118, 5], [119, 0], [122, 6], [123, 7], [124, 8], [196, 9], [222, 10], [259, 11], [265, 12], [266, 0], [280, 17], [306, 14], [326, 15]],
	2030: [[0, 1], [13, 2], [41, 3], [53, 16], [78, 4], [118, 5], [122, 6], [123, 7], [124, 8], [125, 0], [195, 9], [222, 10], [223, 0], [258, 11], [265, 12], [286, 17], [306, 14], [307, 0], [326, 15]],
};
const 休日名 = {
	0: "振替休日", "-1": "国民の休日", "-2": "新天皇即位", "-3": "即位礼正殿の儀",
	1: "元日", 2: "成人の日", 3: "建国記念の日", 4: "春分の日", 5: "昭和の日", 6: "憲法記念日", 7: "みどりの日", 8: "こどもの日",
	9: "海の日", 10: "山の日", 11: "敬老の日", 12: "秋分の日", 13: "体育の日", 14: "文化の日", 15: "勤労感謝の日", 16: "天皇誕生日", 17: "スポーツの日"
};
const 旧暦表 = {
	1999: [[], [], [], [], [], [], [], [], [], [], [342, 11], [372, 12]],
	2000: [[36, 1], [66, 2], [96, 3], [125, 4], [154, 5], [184, 6], [213, 7], [242, 8], [272, 9], [301, 10], [331, 11], [361, 12]],
	2001: [[24, 1], [54, 2], [84, 3], [114, 4], [143, -4], [172, 5], [202, 6], [231, 7], [260, 8], [290, 9], [319, 10], [349, 11], [378, 12]],
	2002: [[43, 1], [73, 2], [103, 3], [132, 4], [162, 5], [191, 6], [221, 7], [250, 8], [279, 9], [309, 10], [338, 11], [368, 12]],
	2003: [[32, 1], [62, 2], [92, 3], [121, 4], [151, 5], [181, 6], [210, 7], [240, 8], [269, 9], [298, 10], [328, 11], [357, 12]],
	2004: [[22, 1], [51, 2], [81, -2], [110, 3], [140, 4], [170, 5], [199, 6], [229, 7], [258, 8], [288, 9], [317, 10], [347, 11], [376, 12]],
	2005: [[40, 1], [69, 2], [99, 3], [128, 4], [158, 5], [187, 6], [217, 7], [247, 8], [276, 9], [306, 10], [336, 11], [365, 12]],
	2006: [[29, 1], [59, 2], [88, 3], [118, 4], [147, 5], [177, 6], [206, 7], [236, -7], [265, 8], [295, 9], [325, 10], [354, 11], [384, 12]],
	2007: [[49, 1], [78, 2], [107, 3], [137, 4], [166, 5], [195, 6], [225, 7], [254, 8], [284, 9], [314, 10], [344, 11], [373, 12]],
	2008: [[38, 1], [68, 2], [97, 3], [126, 4], [156, 5], [185, 6], [214, 7], [244, 8], [273, 9], [303, 10], [333, 11], [362, 12]],
	2009: [[26, 1], [56, 2], [86, 3], [115, 4], [144, 5], [174, -5], [203, 6], [232, 7], [262, 8], [291, 9], [321, 10], [350, 11], [380, 12]],
	2010: [[45, 1], [75, 2], [104, 3], [134, 4], [163, 5], [193, 6], [222, 7], [251, 8], [281, 9], [310, 10], [340, 11], [369, 12]],
	2011: [[34, 1], [64, 2], [93, 3], [123, 4], [153, 5], [182, 6], [212, 7], [241, 8], [270, 9], [300, 10], [329, 11], [359, 12]],
	2012: [[23, 1], [53, 2], [82, 3], [112, -3], [142, 4], [172, 5], [201, 6], [231, 7], [260, 8], [289, 9], [319, 10], [348, 11], [378, 12]],
	2013: [[41, 1], [71, 2], [100, 3], [130, 4], [160, 5], [189, 6], [219, 7], [248, 8], [278, 9], [307, 10], [337, 11], [366, 12]],
	2014: [[31, 1], [60, 2], [90, 3], [119, 4], [149, 5], [178, 6], [208, 7], [237, 8], [267, 9], [297, -9], [326, 10], [356, 11], [385, 12]],
	2015: [[50, 1], [79, 2], [109, 3], [138, 4], [167, 5], [197, 6], [226, 7], [256, 8], [286, 9], [316, 10], [345, 11], [375, 12]],
	2016: [[39, 1], [69, 2], [98, 3], [128, 4], [157, 5], [186, 6], [216, 7], [245, 8], [275, 9], [305, 10], [334, 11], [364, 12]],
	2017: [[28, 1], [57, 2], [87, 3], [116, 4], [146, 5], [175, -5], [204, 6], [234, 7], [263, 8], [293, 9], [322, 10], [352, 11], [382, 12]],
	2018: [[47, 1], [76, 2], [106, 3], [135, 4], [165, 5], [194, 6], [223, 7], [253, 8], [282, 9], [312, 10], [341, 11], [371, 12]],
	2019: [[36, 1], [66, 2], [95, 3], [125, 4], [154, 5], [184, 6], [213, 7], [242, 8], [272, 9], [301, 10], [331, 11], [360, 12]],
	2020: [[25, 1], [55, 2], [84, 3], [114, 4], [144, -4], [173, 5], [203, 6], [232, 7], [261, 8], [291, 9], [320, 10], [350, 11], [379, 12]],
	2021: [[43, 1], [72, 2], [102, 3], [132, 4], [161, 5], [191, 6], [220, 7], [250, 8], [279, 9], [309, 10], [338, 11], [368, 12]],
	2022: [[32, 1], [62, 2], [91, 3], [121, 4], [150, 5], [180, 6], [210, 7], [239, 8], [269, 9], [298, 10], [328, 11], [357, 12]],
	2023: [[22, 1], [51, 2], [81, -2], [110, 3], [140, 4], [169, 5], [199, 6], [228, 7], [258, 8], [288, 9], [317, 10], [347, 11], [376, 12]],
	2024: [[41, 1], [70, 2], [100, 3], [129, 4], [158, 5], [188, 6], [217, 7], [247, 8], [277, 9], [306, 10], [336, 11], [366, 12]],
	2025: [[29, 1], [59, 2], [88, 3], [118, 4], [147, 5], [176, 6], [206, -6], [235, 7], [265, 8], [294, 9], [324, 10], [354, 11], [384, 12]],
	2026: [[48, 1], [78, 2], [107, 3], [137, 4], [166, 5], [195, 6], [225, 7], [254, 8], [284, 9], [313, 10], [343, 11], [373, 12]],
	2027: [[38, 1], [67, 2], [97, 3], [126, 4], [156, 5], [185, 6], [214, 7], [244, 8], [273, 9], [302, 10], [332, 11], [362, 12]],
	2028: [[27, 1], [56, 2], [86, 3], [116, 4], [145, 5], [175, -5], [204, 6], [233, 7], [263, 8], [292, 9], [321, 10], [351, 11], [381, 12]],
	2029: [[44, 1], [74, 2], [104, 3], [133, 4], [163, 5], [193, 6], [222, 7], [251, 8], [281, 9], [310, 10], [339, 11], [369, 12]],
	2030: [[34, 1], [63, 2], [93, 3], [122, 4], [152, 5], [182, 6], [211, 7], [241, 8], [270, 9], [300, 10], [329, 11], [359, 12]]
};
const 九星表 = {
	1989: [47710, 47890],
	1990: [48070, 48250], 1991: [48430, 48610], 1992: [48790, 48970], 1993: [49150, 49330], 1994: [49510, 49690],
	1995: [49870, 50050], 1996: [50230, 50410], 1997: [50620, 50830], 1998: [51010, 51190], 1999: [51370, 51550],
	2000: [51730, 51910], 2001: [52090, 52270], 2002: [52450, 52630], 2003: [52810, 52990], 2004: [53170, 53350],
	2005: [53530, 53710], 2006: [53890, 54070], 2007: [54250, 54430], 2008: [54610, 54820], 2009: [55030, 55210],
	2010: [55390, 55570], 2011: [55750, 55930], 2012: [56110, 56290], 2013: [56470, 56650], 2014: [56830, 57010],
	2015: [57190, 57370], 2016: [57550, 57730], 2017: [57910, 58090], 2018: [58270, 58450], 2019: [58630, 58810],
	2020: [59020, 59230], 2021: [59410, 59590], 2022: [59770, 59950], 2023: [60130, 60310], 2024: [60490, 60670],
	2025: [60850, 61030], 2026: [61210, 61390], 2027: [61570, 61750], 2028: [61930, 62110], 2029: [62290, 62470],
	2030: [62650, 62830], 2031: [63010, 63190]
};
const 九星配置 = [
	[0, 5, 3, 7, 8, 4, 6, 2, 1], [1, 6, 4, 8, 0, 5, 7, 3, 2], [2, 7, 5, 0, 1, 6, 8, 4, 3],
	[3, 8, 6, 1, 2, 7, 0, 5, 4], [4, 0, 7, 2, 3, 8, 1, 6, 5], [5, 1, 8, 3, 4, 0, 2, 7, 6],
	[6, 2, 0, 4, 5, 1, 3, 8, 7], [7, 3, 1, 5, 6, 2, 4, 0, 8], [8, 4, 2, 6, 7, 3, 7, 1, 0]];
const 八方位 = "北|北東|東|南東|南|南西|西|北西".split("|");
const 八卦名 = "坎艮震巽離坤兌乾".split("");
const 八卦図 = n => [
	(n & 1) ? "M-5,4h3M5,4h-3" : "M-5,4H5",
	(n & 2) ? "M-5,0h3M5,0h-3" : "M-5,0H5",
	(n & 4) ? "M-5,-4h3M5,-4h-3" : "M-5,-4H5"].join("");
const 七曜名 = "日月火水木金土".split("");
const 六曜名 = "大安|赤口|先勝|友引|先負|仏滅".split("|");
const 月名 = "睦月|如月|弥生|卯月|皐月|水無月|文月|葉月|長月|神無月|霜月|師走".split("|");
const 漢数字 = "一|二|三|四|五|六|七|八|九|十|十一|十二|十三|十四|十五|十六|十七|十八|十九|廿|廿一|廿二|廿三|廿四|廿五|廿六|廿七|廿八|廿九|卅|卅一|卅二|卅三".split("|");
const 九星名 = "一白水星|二黒土星|三碧木星|四緑木星|五黄土星|六白金星|七赤金星|八白土星|九紫火星".split("|");
const 十干名 = "甲乙丙丁戊己庚辛壬癸".split("");
const 十二支名 = "子丑寅卯辰巳午未申酉戌亥".split("");
const 十干読 = "きのえ|きのと|ひのえ|ひのと|つちのえ|つちのと|かのえ|かのと|みずのえ|みずのと".split("|");
const 十二支読 = "ね|うし|とら|う|たつ|み|うま|ひつじ|さる|とり|いぬ|い".split("|");
const 十二直名 = "建除満平定執破危成納開閉".split("");
const 二十四山 = "子癸丑艮寅甲卯乙辰巽巳丙午丁未坤申庚酉辛戌乾亥壬".split("");
const 二十七宿名 = "角亢氐房心尾箕斗女虚危室壁奎婁胃昴畢觜参井鬼柳星張翼軫".split("");
const 二十八宿名 = "角亢氐房心尾箕斗牛女虚危室壁奎婁胃昴畢觜参井鬼柳星張翼軫".split("");
const D28 = {
	"285": "小寒", "300": "大寒", "315": "立春", "330": "雨水", "345": "啓蟄", "0": "春分",
	"15": "清明", "30": "穀雨", "45": "立夏", "60": "小満", "75": "芒種", "90": "夏至",
	"105": "小暑", "120": "大暑", "135": "立秋", "150": "処暑", "165": "白露", "180": "秋分",
	"195": "寒露", "210": "霜降", "225": "立冬", "240": "小雪", "255": "大雪", "270": "冬至",
	"80": "入梅", "100": "半夏生", "297": "土用入", "27": "土用入", "117": "土用入", "207": "土用入"
};
const YMD2JDN = (YMD, flag) => {
	const y = YMD[0] + Math.floor((YMD[1] - 3) / 12);
	const m = (YMD[1] - 3 % 12), d = YMD[2] - 1;
	return d + Math.floor((153 * m + 2) / 5) + 365 * y + Math.floor(y / 4) - Math.floor(y / 100) + Math.floor(y/ 400) - 678881 + (flag ? 2400001 : 0);
};
let YEAR_TUB, TUB_D12;
function 節気計算(YMD, tdiff) {
	var Y = YMD[0];
	YEAR_TUB = YEAR_TUB || {};
	if (YEAR_TUB[Y]) return YEAR_TUB[Y];
	var angle = Object.keys(D28), dt = initAngle(Y, tdiff);
	var p = YEAR_TUB[Y] = {};
	angle.forEach(r => p[Math.floor(SunDegreeDay(Y, r) - dt)] = D28[r]);
	var n = Math.floor(SunDegreeDay(Y, 315) - dt);
	p[n - 1] = "節分", p[n + 88] = "八十八夜", p[n + 210] = "二百十日", p[n + 220] = "二百二十日";
	n = Math.floor(SunDegreeDay(Y, 0) - dt); p[n - 3] = "彼岸入", p[n + 3] = "彼岸明";
	n = Math.floor(SunDegreeDay(Y, 180) - dt); p[n - 3] = "彼岸入", p[n + 3] = "彼岸明";
	return p;
}
function 節月計算(Y, tdiff) {
	TUB_D12 = TUB_D12 || {};
	if (TUB_D12[Y]) return TUB_D12[Y];
	var angle = []; for (var i = 0; i < 12; i++) angle.push(r360(285 + i * 30));
	var dt = initAngle(Y, tdiff);
	angle = angle.map(r => Math.floor(SunDegreeDay(Y, r) - dt) - 1);
	angle.unshift(Math.floor(SunDegreeDay(Y - 1, 255) - dt) - 1 - YEAR_LENGTH(Y - 1));
	return (TUB_D12[Y] = angle);
}
const r360 = r => { while (r < 0) r += 360; while (r >= 360) r -= 360; return r; };
////=============================================================
function 年間休日(Y) {
	window.休日リスト = window.休日リスト || {};
	if (!window.休日リスト[Y]) {
		var v = window.休日リスト[Y] = {};
		(休日[Y] || []).forEach(t => v[t[0]] = 休日名[t[1]]);
	}
	return window.休日リスト[Y];
}
const DATE2YMD = function (dt) { dt = dt || new Date(); return [dt.getFullYear(), dt.getMonth() + 1, dt.getDate(), dt.getHours(), dt.getMinutes(), dt.getSeconds()]; };
const IS_LEAP = Y => !(Y % 400) || !(Y % 4) && (Y % 100);
const YEAR_LENGTH = Y => IS_LEAP(Y) ? 366 : 365;
const MONTH_LENGTH = YM => [31, IS_LEAP(YM[0]) ? 29 : 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31][YM[1] - 1];
const DAY_NUMBER = YMD => YMD2JDN(YMD) - YMD2JDN([YMD[0], 1, 1]);
const YMD_COMP = (d1, d2) => YMD2JDN(d1) - YMD2JDN(d2 ? d2 : DATE2YMD().slice(0, 3));
function SunDegree(T) {
	T /= 36525;
	const p180 = Math.PI / 180;
	const sum = a => { var n = 0; a.forEach(t => { n += t; }); return n; }
	const sl = [
		[0.0004, 31557, 161], [0.0004, 29930, 48], [0.0005, 2281, 221], [0.0005, 155, 118], [0.0006, 33718, 316], [0.0007, 9038, 64],
		[0.0007, 3035, 110], [0.0007, 65929, 45], [0.0013, 22519, 352], [0.0015, 45038, 254], [0.0018, 445267, 208], [0.0018, 19, 159],
		[0.002, 32964, 158], [-0.0048, 35999, 268], [0.02, 71998.1, 265.1], [1.9147, 35999.05, 267.52], [280.4659, 0, 0], [36000.7695, 0, 0]];
	var r = sum(sl.map((t, i) => t[0] * Math.cos((t[1] * T + t[2]) * p180) * (((i == 17) || (i == 13)) ? T : 1)));
	var d = -0.0057 + 0.0048 * Math.cos((1934 * T + 145) * p180);
	return r360(r + d);
}
function SunDegreeDay(Y, degree) {
	var t0 = YMD2JDN([Y, 1, 0]) - YMD2JDN([2000, 1, 1.5]), r0 = SunDegree(t0);
	var ofs = (degree < r0) ? 360 : 0;
	var t = Math.floor((degree - r0 + ofs) * 0.9);
	while (1) {
		var r = SunDegree(t0 + t); if (r < r0) r0 -= ofs;
		if ((r0 < degree) && (degree <= r)) {
			t += (degree - r) / (r - r0);
			return t + (degree - SunDegree(t0 + t)) / (r - r0);
		}
		r0 = r; t++;
	}
}
function initAngle(Y, tdiff = 9) {
	return (58 + 0.44 * (Y - 1990)) / 86400 - (tdiff / 24);
}
function 黄経計算(YMD, tdiff = 9) {
	return r360(SunDegree(YMD2JDN(YMD) - YMD2JDN([2000, 1, 1.5])) - initAngle(YMD[0], tdiff));
}
function Calender(YMD, flag) { return "<svg/>"
	var today = DATE2YMD();
	today = (today[0] == YMD[0] && today[1] === YMD[1]) ? today[2] : 0;
	var svg = $.SVG_HEAD(0, 0, 100, 70), w = 100 / 8, h = 9;
	var body = $.SVG_ELEM("g", { "font-family": fontFamily, "dominant-baseline": "middle" }).appendTo(svg);
	flag && $.SVG_TEXT(Months[YMD[1] - 1] + " (" + YMD[1] + "月)", { size: 8, transform: "translate(50,5)" }).appendTo(body);
	var hover = $.SVG_ELEM("rect", { x: 5, y: 9, width: 90, height: 61, rx: 5, ry: 5, fill: "rgba(0,0,0,0)" }).appendTo(body)
	Days.forEach((t, n) => $.SVG_TEXT(t, { size: 4, color: Colors[n], x: w * (n + 1), y: 12 }).appendTo(body));
	var 休日 = 月間休日(YMD), n = YMD2DAY([YMD[0], YMD[1], 1]), x, y = 22;
	for (var i = 1; i <= MONTH_LENGTH(YMD); i++) {
		x = w * (n + 1);
		(today == i) && $.SVG_ELEM("rect", { x: x - w / 2, y: y - h / 2, width: w, height: h, fill: "none", stroke: "#f40", "stroke-width": 0.5 }).appendTo(body);
		(YMD[2] == i) && $.SVG_ELEM("rect", { x: x - w / 2, y: y - h / 2, width: w, height: h, fill: "none", stroke: "#444", "stroke-width": 0.5 }).appendTo(body);
		var d = $.SVG_TEXT(i, { name: "D" + i, size: 8, color: 休日[i] ? RED : Colors[n], x: x, y: y }).appendTo(body);
		休日[i] && d.TipBox(休日[i]);
		n++; n == 7 && (n = 0, y += h);
	}
	hover.mouseenter(() => hover.css({ "fill": "#ffd" })).mouseleave(() => hover.css({ "fill": "rgba(0,0,0,0)" }));
	return svg;
}
export function 日めくり(YMD) { 
	const day = (YMD2JDN(YMD) + 3) % 7, 色 = ["RED", "BLACK", "BLACK", "BLACK", "BLACK", "BLACK", "BLUE"][day];
	const Month = ["January", "Feburary", "March", "April", "May", "June", "July", "August", "September", "October", "November", "December"][YMD[1] - 1];
	const Day = ["SUN", "MON", "TUE", "WED", "THU", "FRI", "SAT"][day];

	const q = 日暦情報(YMD), 休日 = q.休日(), 元号 = q.元号();
	console.log(q); console.log(q.月相);
	var 日数 = YMD_COMP(YMD); 日数 = 日数 > 0 ? comma(日数) + "日後" : 日数 < 0 ? comma(-日数) + "日前" : "今日";
	const 旧暦名 = q.旧暦名();
	const dy = ({ 4: "1 6 8 6", 5: "1 5 5 5 5", 6: "0 4.4 4.4 4.4 4.4 4.4", 7: "0 4 4 4 4 4 4" })[旧暦名.length];
	const 節気 = q.節気(), a = 節[節気] || ["", ""];//, s, t;
	const 節気説明 = "<b>" + 節気 + "</b>:" + (a[0] ? "「<i style='color:#ddf;'>" + a[0] + "</i>」<br/>" : " ") + a[1];
	const 宿説明 = t => [t[1] + "の宿に入る。", t[2]].join("\n");
	const 暦注説明 = t => "<b>" + t + "</b>: " + 注[t];
	const p = q.黄経();
	const 暦注 = q.暦注().map(t => `<tspan tip=${暦注説明(t)}>${t+"　"}</tspan>`).join("");
	return `
	<svg viewBox="0 0 100 100" xmlns="http://www.w3.org/2000/svg" xlinkns="http://www.w3.org/1999/xlink" version="1.1" style="user-select: none;">
		<rect width="100" height="100" fill="#fff"/>
		<circle r="25" fill="#a22" transform="translate(50,40)" style="display:${休日?"block":"none"};"/>
		<g fill="#444" dominant-baseline="middle" text-anchor="middle" font-family="Arial">
			<text font-size="6" transform="translate(50,8)">
				<tspan>${Month}</tspan><tspan> </tspan><tspan>${YMD[0]}</tspan>
			</text>
			<text font-size="3" transform="translate(50,95)">暦注</text>
			<g transform="translate(50,45)">
				<text font-size="55" stroke="#fff" fill="${色}" transform="${YMD[2] > 9 ? "scale(0.8 1)" : "scale(1.1 1)"}" stroke-width="0.2" font-weight="700" dominant-baseline="middle">${YMD[2]}</text>
			</g>
			<text font-size="6" font-weight="700" transform="translate(50,69)" tip="${節気説明}">
				<tspan fill="#a22">${休日}<tspan><tspan>${節気}<tspan>
			</text>
			<text font-size="8" font-weight="700"><tspan fill="${色}" x="10 10 10" y="10 18 26">${q.曜日()}曜日</tspan></text>
			<text font-size="4" fill="${色}" transform="translate(10,33)">${Day}</text>
			<text font-size="8" font-weight="700"><tspan x="90 90" y="10 18">${元号[0]}</tspan></text>
			<text transform="translate(90,28)" font-size="9" font-weight="700">${元号[1] == 1 ? "元" : 元号[1]}</text>
			<text transform="translate(90,36)" font-size="8" font-weight="700">年</text>
			<text transform="translate(90,46)" font-size="9" font-weight="700">${YMD[1]}</text>
			<text transform="translate(90,54)" font-size="8" font-weight="700">月</text>
			<text transform="translate(90,61)" font-size="4">${q.旧月()}</text>
			<text transform="translate(75,70)" font-size="3">${日数}</text>
			<g transform="translate(85,65) scale(0.1)">${q.月相()}</g>
			<g transform="translate(35,66) scale(0.3)">${Calender(YMD) }</g>
			<text font-size="4" transform="translate(7,40)"><tspan x="0 0" y="0 4">旧暦</tspan></text>
			<text font-size="4" transform="translate(7,50)"><tspan x="0 0 0 0 0 0 0" dy="${dy}">${旧暦名}</tspan></text>
			<text font-size="4" transform="translate(13,40)"><tspan x="0 0" dy="0 4" tip="${曜[q.六曜()]}">${q.六曜()}</tspan></text>
			<text font-size="4" transform="translate(13,50)"><tspan x="0 0" dy="0 4">${q.日干支()}</tspan></text>
			<text font-size="4" transform="translate(13,60)"><tspan x="0 0 0 0" dy="0 4 4 4"/>${q.日家九星()}</text>
			<text font-size="2.5" transform="translate(18,45)"><tspan x="0 0 0 0 0 0 0 0" dy="0 2.5 2.5 2.5 2.5 2.5 2.5 2.5">${q.日干支読()}</tspan></text>
			<text font-size="2.5" transform="translate(8,78)">十二直</text>
			<text font-size="2.5" transform="translate(18,78)">二十八宿</text>
			<text font-size="2.5" transform="translate(28,78)">二十七宿</text>
			<text font-size="6" font-weight="700" transform="translate(8,86)" tip="${直[q.十二直()][1]}">${q.十二直()}</text>
			<text font-size="6" font-weight="700" transform="translate(18,86)" tip="${宿[q.二十八宿()][1]}">${q.二十八宿()}</text>
			<text font-size="6" font-weight="700" transform="translate(28,86)" tip="${宿[q.二十七宿()][1]}">${q.二十七宿()}</text>
			<text font-size="2.5" transform="translate(8,90)">${直[q.十二直()][0]}</text>
			<text font-size="2.5" transform="translate(18,90)">${宿[q.二十八宿()][0]}</text>
			<text font-size="2.5" transform="translate(28,90)">${宿[q.二十七宿()][0]}</text>
			<text font-size="3" transform="translate(82,78)">${p[2]}${(p[3] === 1 ? "初日" : "から" + p[3] + "日目")}(${p[1]})</text>
			<text font-size="3" transform="translate(82,83)">${p[4]}まで${p[5]}日目</text>
			<text font-size="3" transform="translate(82,88)">(太陽黄経: ${p[0].toFixed(2)}度)</text>
		</g>
	</svg>`;
};
function 日暦情報(YMD) { //if (YMD[0] < 2000 || YMD[0] > 2030) return null;
	let L2 = n => (n > 9 ? "" : "0") + n;
	let 通日 = YMD2JDN(YMD), 黄経 = 黄経計算(YMD), 年通日 = DAY_NUMBER(YMD) + 1, i;
	var 年休日 = 年間休日(YMD[0]);
	let 節気 = 節気計算(YMD), 月節 = 節月計算(YMD[0]);
	let 節日 = 節日計算(), 旧暦 = 旧暦計算();
	let 九星 = 九星計算(), 干支 = 干支計算();
	////--------------------------------------------------------------------
	return {
		旧暦: 旧暦計算(), 節日: 節日計算(), 九星: 九星計算(), 干支: 干支計算(),
		元号: 元号, 休日: () => 年休日[年通日 - 1] || "",
		曜日: () => 七曜名[(通日 + 3) % 7], 六曜: () => 六曜名[(旧暦.月 + 旧暦.日) % 6],
		十二直: () => 十二直計算(),
		二十八宿: () => 二十八宿名[(通日 + 20) % 28],
		二十七宿: () => 二十七宿名[([11, 13, 15, 17, 19, 21, 24, 0, 2, 4, 7, 9][旧暦.月 - 1] + (旧暦.日 - 1)) % 27],
		年家九星: () => 九星名[九星.年], 月家九星: () => 九星名[九星.月], 日家九星: () => 九星名[九星.日],
		時家九星: i => (9 + 九星.時[0] + (九星.時[1] ? -1 : 1) * i) % 9,
		時家九星表: () => 十二支名.map((t, i) => [t, 九星名[(9 + 九星.時[0] + (九星.時[1] ? -1 : 1) * i) % 9]]),
		年家九星盤: opts => 九星盤($.extend({ number: 九星.年 + 1, simple: true }, opts)),
		月家九星盤: opts => 九星盤($.extend({ number: 九星.月 + 1, simple: true }, opts)),
		日家九星盤: opts => 九星盤($.extend({ number: 九星.日 + 1, simple: true }, opts)),
		年干支: () => 干支.年, 月干支: () => 干支.月, 日干支: () => 干支.日,
		節気: () => 節気[年通日] || "",
		日付: () => YMD[0] + "年" + YMD[1] + "月" + YMD[2] + "日",
		旧暦名: () => (旧暦.閏 ? '閏' : "") + 漢数字[旧暦.月 - 1] + "月" + 漢数字[旧暦.日 - 1] + "日",
		節日名: () => (節日.月 == 1 ? "正" : 漢数字[節日.月 - 1]) + "月節" + 節日.日 + "日",
		旧月: () => 月名[YMD[1] - 1],
		暦注: () => 暦注計算(),
		日干支読: () => 十干読[通日 % 10] + "・" + 十二支読[(通日 + 2) % 12],
		日出時刻: pos => 時刻(太陽計算(YMD, pos)[0]),
		日入時刻: pos => 時刻(太陽計算(YMD, pos)[1]),
		南中時刻: pos => 時刻(太陽計算(YMD, pos)[2]),
		南中仰角: pos => 太陽計算(YMD, pos)[3],
		黄経: () => {
			var r2day = (y, r) => Math.floor(SunDegreeDay(y, r) - initAngle(y));
			var r = Math.floor(黄経 / 15) * 15;
			var 候 = (黄経 - r < 5) ? "初候" : (黄経 - r < 10) ? "次候" : "末候";
			var r0 = r2day(YMD[0] + ((r == 270 && YMD[1] == 1) ? -1 : 0), r360(r));
			var r1 = r2day(YMD[0] + ((r == 270 && YMD[1] == 12) ? 1 : 0), r360(r + 15));
			if (r1 === 年通日) { r0 = r1; r1 = r2day(YMD[0], r360(r + 30)), 候 = "初候"; }
			var n0 = 年通日 - r0 + (r0 > 年通日 ? YEAR_LENGTH(YMD[0] - 1) : 0) + 1;
			var n1 = r1 - 年通日 + (r1 < 年通日 ? YEAR_LENGTH(YMD[0] - 1) : 0);
			return [黄経, 候, 節気[r0], n0, 節気[r1], n1];
		},
		月相: () => 月相(旧暦.日 - 1)
	};
	////--------------------------------------------------------------------
	function 時刻(t) { var h = Math.floor(t), m = Math.round((t - h) * 60); return L2(h) + ":" + L2(m) }
	function 元号(flag) {
		var s =
			YMD_COMP(YMD, [2019, 5, 1]) >= 0 ? ["R", YMD[0] - 2018] :
			YMD_COMP(YMD, [1989, 1, 8]) >= 0 ? ["H", YMD[0] - 1988] :
			YMD_COMP(YMD, [1926, 12, 25]) >= 0 ? ["S", YMD[0] - 1925] :
			YMD_COMP(YMD, [1912, 7, 30]) >= 0 ? ["T", YMD[0] - 1911] :
			YMD_COMP(YMD, [1968, 9, 8]) >= 0 ? ["M", YMD[0] - 1967] : ["", YMD[0]];
		return flag ? s : [({ R: "令和", H: "平成", S: "昭和", T: "大正", M: "明治" })[s[0]], s[1]] || ["", s[1]];
	}
	function 節日計算() {
		let y = YMD[0] - 1, m = 0, d = 0;
		月節.forEach((t, i) => (t < 年通日) && (m = (i + 10) % 12 + 1, (m == 1 && (y = YMD[0])), d = 年通日 - t));
		return { 年: y, 月: m, 日: d };
	}
	function 旧暦計算() {
		if (!旧暦表[YMD[0]]) return 旧暦計算0();
		let last = 年通日 < 旧暦表[YMD[0]][0][0];
		let 年 = YMD[0] - (last ? 1 : 0);
		let ym = 年通日 + (last ? YEAR_LENGTH(年) : 0);
		let tbl = [].concat(旧暦表[年]).reverse(), i;
		for (i = 0; tbl[i]; i++) if (tbl[i][0] <= ym) break;
		let 閏 = !!(tbl[i][1] < 0), 月 = Math.abs(tbl[i][1]), 日 = ym - tbl[i][0] + 1;
		return { 年: 年, 月: 月, 日: 日, 閏: 閏 };
	}
	function 旧暦計算0() {
		const pr_s = [
			[31557, 29930, 2281, 155, 33718, 9038, 3035, 65929, 22519, 45038, 445267, 19, 32964, 71998.1, 35999.05, 36000.7695],
			[161, 48, 221, 118, 316, 64, 110, 45, 352, 254, 208, 159, 158, 265.1, 267.52, 280.4659],
			[.0004, .0004, .0005, .0005, .0006, .0007, .0007, .0007, .0013, .0015, .0018, .0018, .002, .02, 1.9147, -0.0048]];
		const pr_m = [
			[2322131, 4067, 549197, 1808933, 349472, 381404, 958465, 12006, 39871, 509131, 1745069, 1908795, 2258267, 111869, 27864, 485333, 405201, 790672, 1403732, 858602, 1920802, 1267871, 1856938, 401329, 341337, 71998, 990397, 818536, 922466, 99863, 1379739, 918399, 1934, 541062, 1781068, 133, 1844932, 1331734, 481266, 31932, 926533, 449334, 826671, 1431597, 1303870, 489205, 1443603, 75870, 513197.9, 445267.1, 441199.8, 854535.2, 1367733.1, 377336.3, 63863.5, 966404, 35999.05, 954397.74, 890534.22, 413335.35, 477198.868, 481267.8809],
			[191, 70, 220, 58, 337, 354, 340, 187, 223, 242, 24, 90, 156, 38, 127, 186, 50, 114, 98, 129, 186, 249, 152, 274, 16, 85, 357, 151, 163, 122, 17, 182, 145, 259, 21, 29, 56, 283, 205, 107, 323, 188, 111, 315, 246, 142, 52, 41, 222.5, 27.9, 47.4, 148.2, 280.7, 13.2, 124.2, 276.5, 87.53, 179.93, 145.7, 10.74, 44.963, 218.3162],
			[.0003, .0003, .0003, .0003, .0003, .0003, .0003, .0004, .0004, 0.0005, 0.0005, 0.0005, 0.0006, 0.0006, .0007, .0007, .0007, .0007, .0008, .0009, .0011, .0012, .0016, .0018, .0021, .0021, .0021, .0022, .0023, .0024, .0026, .0027, .0028, .0037, .0038, .004, .004, .004, .005, .0052, .0068, .0079, .0085, .01, .0107, .011, .0125, .0154, .0304, .0347, .0409, .0458, .0533, .0571, .0588, .1144, .1851, .2136, .6583, 1.274, 6.2888]];
		const deg = Math.PI / 180;
		const cos = t => Math.cos(t * deg);
		const abs = t => Math.abs(t)
		const adj = 9 / 24;
		const min = 1 / 86400;
		function calc(p0, p1) {
			const q0 = 365.2 / 360;
			return tm => {
				let t1 = tm | 0, t2 = tm - t1 - adj, d1 = 0, d2 = 1, d3, t;
				let lsun = p0 * (sun((t2 + .5) / 36525 + (t1 - 2451545) / 36525) / p0 | 0);
				while (abs(d1 + d2) > min) {
					d3 = sun((t2 + .5) / 36525 + (t1 - 2451545) / 36525) - lsun;
					d3 += d3 > 180 ? -360 : d3 < -180 ? 360 : 0;
					t = d3 * q0;
					t1 -= (d1 = t | 0);
					t2 -= (d2 = t / p1 - d1); t2 < 0 && (t2 += 1, t1 -= 1);
				}
				return [t1 + t2 + adj, lsun];
			};
		}
		var chuki = calc(30, 1);
		var nibun = calc(90, 360);
		var julius = tm => {
			const q0 = 29.530589 / 360;
			let t1 = tm | 0, t2 = tm - t1 - adj;
			let cnt = 1, d1 = 0, d2 = 1, d3, t, lsun, lmoon;
			while (abs(d1 + d2) > min) {
				t = (t2 + .5) / 36525 + (t1 - 2451545) / 36525;
				d3 = (lmoon = moon(t)) - (lsun = sun(t));
				t = (d3 < 0 ? 360 : 0) + d3 % 360;
				if (cnt == 1 && d3 < 0) d3 = t;
				else if (lsun >= 0 && lsun <= 20 && lmoon >= 300) d3 = 360 - t;
				else if (abs(d3) > 40) d3 = t;
				t = d3 * q0;
				t1 -= (d1 = t | 0);
				t2 -= (d2 = t - d1);
				t2 < 0 && (t2 += 1, t1 -= 1);
				if (abs(d1 + d2) > min) {
					if (cnt == 15) t1 = tm - 26 | (t2 = 0);
					else if (cnt > 30) return tm + adj;
				}
				cnt++;
			}
			return t2 + t1 + adj;
		}
		var sun = t => {
			for (var i = 0, th = 0, b; i < 15; i++) th += (b = cos((pr_s[0][i] * t + pr_s[1][i]))) * pr_s[2][i];
			return (b = (pr_s[0][i] * t + pr_s[1][i] + th + b * pr_s[2][i] * t) % 360) < 0 ? 360 + b : b;
		};
		var moon = t => {
			for (var i = 0, th = 0, b; i < 61; i++) th += cos((pr_m[0][i] * t + pr_m[1][i])) * pr_m[2][i];
			return (b = (pr_m[0][i] * t + pr_m[1][i] + th) % 360) < 0 ? 360 + b : b;
		};
		//		var ymd = [this.getFullYear(), this.getMonth() + 1, this.getDate()];
		var JD = YMD2JDN(YMD, true) - 1;
		var chu = [nibun(JD)], saku = [];
		for (let i = 1; i < 4; i++) chu[i] = chuki(chu[i - 1][0] + 32);
		saku[0] = julius(chu[0][0]);
		for (let i = 1; i < 5; i++) {
			let t = saku[i - 1];
			saku[i] = julius(t + 30);
			if (abs((t | 0) - (saku[i] | 0)) <= 26) saku[i] = julius(t + 35);
		}
		if ((saku[1] | 0) <= (chu[0][0] | 0)) {
			saku[0] = saku[1]; saku[1] = saku[2]; saku[2] = saku[3]; saku[3] = saku[4];
			saku[4] = julius(saku[3] + 35);
		} else if ((saku[0] | 0) > (chu[0][0] | 0)) {
			saku[4] = saku[3]; saku[3] = saku[2]; saku[2] = saku[1]; saku[1] = saku[0];
			saku[0] = julius(saku[0] - 27);
		}
		var lap = saku[4] <= chu[3][0] ? 1 : 0;
		var m = [[(chu[0][1] / 30 | 0) + 2, 0, saku[0] | 0]];
		let j = 0;
		for (let i = 1; i < 5; i++) {
			if (lap == 1 && i != 1) {
				if (chu[j][0] <= saku[j] || chu[j][0] >= saku[i]) {
					m[j] = [m[i - 2][0], 1, saku[j] | 0];
					lap = 0;
				}
			}
			m[i] = [m[j][0] + 1, 0, saku[i] | 0];
			m[i][0] > 12 && (m[i][0] -= 12);
			j = i;
		}
		var n = 0, state = 0;
		for (; n < 5; n++) {
			let t = m[n][2] | 0;
			if (JD < t) { state = 1; break; }
			if (JD == t) { state = 2; break; }
		}
		2 > state && n--;
		var year = YMD[0] - ((m[n][0] > 9 && m[n][0] > YMD[1]) ? 1 : 0);
		return { 年: year, 月: m[n][0], 日: JD - (m[n][2] | 0) + 1, 閏: m[n][1] };
	};
	function 干支計算() {
		let 年 = 十干名[(YMD[0] + 6) % 10] + 十二支名[(YMD[0] + 8) % 12];
		let 月 = 十干名[(((旧暦.年 + 2) % 5) * 2 + 旧暦.月 - 1) % 10] + 十二支名[(旧暦.月 + 1) % 12];
		let 日 = 十干名[通日 % 10] + 十二支名[(通日 + 2) % 12];
		return { 年: 年, 月: 月, 日: 日 }
	}
	function 九星計算() {
		var q = {};
		q.年 = 8 - (節日.年 - 2) % 9;
		q.月 = (18 + [7, 4, 1][(節日.年 + 2) % 3] - (節日.月 - 1)) % 9;
		if (!(九星表[YMD[0] - 1] && 九星表[YMD[0]] && 九星表[YMD[0] + 1])) return q;
		let 遁 = [九星表[YMD[0] - 1][1], 九星表[YMD[0]][0], 九星表[YMD[0]][1], 九星表[YMD[0] + 1][0]];
		let 閏遁 = [((遁[0] + 50) % 60) ? 6 : 0, ((遁[2] + 50) % 60) ? 6 : 0];
		let 陰遁 = 通日 < 遁[0] || (遁[1] <= 通日 && 通日 < 遁[2]);
		q.日 = ((通日 < 遁[1]) ?
			(((通日 < 遁[0]) ? (遁[0] - 通日 - 1) : (通日 - 遁[0])) + 閏遁[0]) :
			(((通日 < 遁[2]) ? (遁[2] - 通日 - 1) : (通日 - 遁[2])) + 閏遁[1])) % 9;
		q.時 = [(陰遁 ? [8, 5, 2] : [0, 3, 6])[(通日 + 2) % 3], 陰遁];
		return q;
	}
	function 十二直計算() {
		let m0 = 0, d0 = 0, m1 = 0, d1 = 0;
		月節.forEach((t, i) => (t < 年通日) && (m0 = (i + 10) % 12 + 1, d0 = 年通日 - t, m1 = (i + 9) % 12 + 1, d1 = i ? 年通日 - 月節[i - 1] - 1 : 0));
		let n0 = (12 - (((通日 - d0) + 3) - (m0 + 1)) % 12) % 12;
		let n1 = (12 - (((通日 - d1) + 2) - (m1 + 1)) % 12) % 12;
		return 十二直名[((m1 > n0) ? (12 + d0 - n0 - 1) : (12 + d1 - n1 - 1)) % 12];
	}
	function 暦注計算() {
		const a = [];
		const 干支 = (通日 + 50) % 60, 干 = 干支 % 10, 支 = 干支 % 12, 月 = 節日.月 - 1;
		////=================================================================================
		(旧暦.月 == 8 && 旧暦.日 === 1) && a.push("八朔");
		(旧暦.月 == 1 && 旧暦.日 === 1) && a.push("旧正月");
		(旧暦.月 == 1 && 旧暦.日 === 7) && a.push("人日節句(旧暦)");
		(旧暦.月 == 3 && 旧暦.日 === 3) && a.push("上巳節句(旧暦)");
		(旧暦.月 == 5 && 旧暦.日 === 5) && a.push("端午節句(旧暦)");
		(旧暦.月 == 7 && 旧暦.日 === 7) && a.push("七夕節句(旧暦)");
		(旧暦.月 == 9 && 旧暦.日 === 9) && a.push("重陽節句(旧暦)");
		////=================================================================================暦注下段
		(27 <= 黄経 && 黄経 < 45) && a.push("土用");
		(117 <= 黄経 && 黄経 < 135) && a.push((支 === 1) ? "土用の丑" : "土用");
		(207 <= 黄経 && 黄経 < 225) && a.push("土用");
		(297 <= 黄経 && 黄経 < 315) && a.push("土用");
		支 === [10, 4, 11, 5, 0, 6, 1, 7, 2, 8, 3, 9][月] && a.push("受死日");
		支 === [9, 5, 1, 9, 5, 1, 9, 5, 1, 9, 5, 1][月] && a.push("十死日");
		if (a.length == 0) {
			[1, 4, 7, 22, 28].includes(干支) && a.push("五墓日");
			支 === [1, 2, 0, 1, 2, 0, 1, 2, 0, 1, 2, 0][月] && a.push("帰忌日");
			支 === [1, 7, 2, 8, 3, 9, 4, 10, 5, 11, 6, 0][月] && a.push("血忌日");
			支 === [0, 3, 6, 9, 0, 3, 6, 9, 0, 3, 6, 9][月] && a.push("天火日");
			支 === [5, 6, 7, 8, 9, 10, 11, 0, 1, 2, 3, 4][月] && a.push("地火日");
			[[27, 50], [15, 51, 57], [0, 1, 2, 3, 4, 8, 44, 16, 20, 40, 32, 56], [4, 7, 19, 31, 35, 42, 43, 54, 55, 59],
			[42, 54], [5, 42, 43, 53, 55], [21, 40, 56], [45, 51, 57], [10, 27, 28, 29, 30, 31, 32, 33, 34, 46, 50],
				[1, 5, 13, 24, 25, 34, 35, 37, 48, 49, 53, 59], [24, 42, 48], [24, 43, 48, 59]][旧暦.月 - 1].includes(干支) && a.push("凶会日");
			節日.日 === [7, 14, 21, 8, 16, 24, 9, 18, 27, 10, 20, 30][月] && a.push("往亡日");
			支 === [11, 6, 1, 8, 3, 10, 4, 0, 7, 2, 9, 4][月] && a.push("大禍日(" + (十二支名[(月 + 2) % 12]) + "年生)");
			支 === [0, 3, 6, 9, 0, 3, 6, 9, 0, 3, 6, 9][月] && a.push("狼藉日(" + (十二支名[(月 + 2) % 12]) + "年生)");
			支 === [5, 0, 7, 2, 9, 4, 11, 6, 1, 8, 3, 10][月] && a.push("滅門日(" + (十二支名[(月 + 2) % 12]) + "年生)");
			支 === [7, 10, 4, 2, 6, 0, 8, 9, 5, 11, 1, 3][月] && a.push("時下食(" + 十二支名[[11, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10][月]] + "刻)");
			干支 === [13, 26, 3, 28, 53, 42, 43, 56, 33, 22, 47, 4][(節日.年 + 8) % 12] && a.push("歳下食");
			////----------------------------------------------------------------------------
			(月 < 3 ? (干支 === 14) : 月 < 6 ? (干支 === 30) : 月 < 9 ? (干支 === 44) : 干支 === 0) && a.push("天赦日");
			[1, 3, 4, 6, 8, 9, 13, 15, 18, 20, 21, 24, 27, 30, 32, 33, 35, 36, 37, 39, 41, 42, 43, 44, 45, 47, 48, 51, 54, 55, 56, 57, 59].includes(干支) && a.push("神吉日");
			[7, 8, 9, 13, 15, 18, 20, 23, 28, 31, 38, 40, 41, 42, 45, 46, 47, 52, 55, 56, 57].includes(干支) && a.push("大明日");
			((通日 + 20) % 28 === 22) && a.push("鬼宿日");
			[0, 1, 2, 3, 4, 15, 16, 17, 18, 19, 45, 46, 47, 48, 49].includes(干支) && a.push("天恩日");
			($.inArray(支, [[0, 11], [0, 11], [5, 6], [2, 3], [2, 3], [5, 6], [1, 4, 7, 10], [1, 4, 7, 10], [5, 6], [8, 9], [8, 9], [5, 6]][月]) + 1) && a.push("母倉日");
			干 === [2, 0, 8, 6, 2, 0, 8, 6, 2, 0, 8, 6][月] && a.push("月徳日");
			(支 === 5 || 支 === 11) && a.push("重日");
			($.inArray(干, [[0, 6], [1, 7], [4, 5], [2, 8], [3, 9], [4, 5], [0, 6], [1, 7], [4, 5], [2, 8], [3, 9], [4, 5]][月]) + 1) && a.push("復日");
		}
		////=================================================================================社日
		if (干 === 4) {
			if (月 === 1) {
				let 春分通日 = 年通日 - Math.floor(SunDegreeDay(YMD[0], 0));
				(-5 <= 春分通日 && 春分通日 < 5) && a.push("社日");
			} else if (月 === 7) {
				let 秋分通日 = 年通日 - Math.floor(SunDegreeDay(YMD[0], 180));
				(-5 <= 秋分通日 && 秋分通日 < 5) && a.push("社日");
			}
		}
		////=================================================================================選日
		[48, 50, 51, 53, 55, 56, 57, 59].includes(干支) && a.push("八専");
		[49, 52, 54, 58].includes(干支) && a.push("八専間日");
		[20, 21, 23, 24, 26, 27, 28, 29].includes(干支) && a.push("十方暮");
		[[3, 11, 19, 27], [2, 10, 18, 26], [1, 9, 17, 25], [4, 12, 20, 28], [5, 13, 21, 29], [6, 14, 22, 30]][(旧暦.月 - 1) % 6].includes(旧暦.日) && a.push("不成就日");
		(29 <= 干支 && 干支 <= 24) && a.push("天一天上");
		支 === [11, 2, 6, 11, 2, 6, 11, 2, 6, 11, 2, 6][月] && a.push("三隣亡");
		if (干 === 6) {
			if (月 === 4 || 月 === 5) {
				let 夏至通日 = 年通日 - Math.floor(SunDegreeDay(YMD[0], 90));
				(20 <= 夏至通日 && 夏至通日 <= 29) && a.push("初伏");
				(30 <= 夏至通日 && 夏至通日 <= 39) && a.push("中伏");
			} else if (月 === 6) {
				let 立秋通日 = 年通日 - Math.floor(SunDegreeDay(YMD[0], 135));
				(0 <= 立秋通日 && 立秋通日 <= 9) && a.push("末伏");
			}
		}
		[[1, 6], [9, 2], [0, 3], [3, 4], [5, 6], [9, 6], [0, 7], [3, 8], [9, 6], [9, 10], [11, 0], [3, 0]][月].includes(支) && a.push("一粒万倍日");
		(6 <= 干支 && 干支 <= 12) && a.push("大犯土");
		(14 <= 干支 && 干支 <= 20) && a.push("小犯土");
		if (支 === 4 && 月 === 11) {
			let 小寒通日 = 年通日 - Math.floor(SunDegreeDay(YMD[0], 285));
			(12 <= 小寒通日 && 小寒通日 <= 23) && a.push("臘日");
		}
		(干支 === 0) && a.push("甲子");
		//	(干支 === 5) && a.push("己巳");
		(干支 === 16) && a.push("庚辰");
		//	(干支 === 57) && a.push("辛酉");
		////----------------------------------------------------------------------------
		return a;
	}
	function 月相(n) {
		const T = 29.530589;
		const r = Math.min(1, Math.max(0, (n / T))), p = Math.floor(r * 4), R = Math.cos(r * 2 * Math.PI);
		return `<svg  viewBox="-51 -51 102 102">
		<circle r="50" fill="#400/>
		<path d="M0,-50A50,50 0 0${(p < 2 ? 1 : 0) + " 0,50A" + 50 * R + ",50 0 0 " + (p % 2 ? 1 : 0) } 0 -50Z" fill="#ff8"/>
		<circle r="50" fill="none" stroke="#000" stroke-width="2"/>
		</svg>`;
	}
}